AlmAck/nuttx/arch/arm/src/da1470x/da1470x_snc.c
/****************************************************************************
 * arch/arm/src/da1470x/da1470x_snc.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/* The sensor node controller is the third processor on this part: a
 * Cortex-M0+ at up to 32 MHz that reaches every peripheral and keeps
 * running while the M33 sleeps.  What it is for is the work that would
 * otherwise wake the M33 for no good reason: a wake of the M33 was
 * measured on this board at about 39 uC, so polling at a hundred hertz from
 * the M33 costs milliamps before anything is even read.
 *
 * This driver loads the controller's firmware -- built from
 * arch/arm/src/da1470x/snc/ as part of the NuttX build and embedded in the
 * image -- starts it, and carries messages both ways through RAM8 (see
 * da1470x_snc_ipc.h).  The controller rings the SNC2SYS doorbell when it
 * has queued something; the interrupt hands the ring to the low priority
 * work queue, which gives each message to the kernel handler registered for
 * its type, or queues it for readers of the character device.
 */

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <inttypes.h>
#include <string.h>
#include <errno.h>
#include <fcntl.h>
#include <poll.h>
#include <debug.h>
#include <syslog.h>

#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <nuttx/fs/fs.h>
#include <nuttx/mutex.h>
#include <nuttx/sched.h>
#include <nuttx/semaphore.h>
#include <nuttx/wqueue.h>

#include <arch/chip/snc.h>

#include "arm_internal.h"
#include "hardware/da1470x_crg_top.h"
#include "hardware/da1470x_crg_xtal.h"
#include "hardware/da1470x_gpreg.h"
#include "hardware/da1470x_crg_snc.h"
#include "hardware/da1470x_uart.h"
#include "da1470x_lowputc.h"
#include "da1470x_clockconfig.h"
#include "da1470x_pmu.h"
#include "da1470x_snc.h"
#include "da1470x_snc_ipc.h"

#ifdef CONFIG_DA1470X_PDC
#  include "da1470x_pdc.h"
#endif

#ifdef CONFIG_DA1470X_SNC

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define DA1470X_SNC_STATUS      (DA1470X_SNC_BASE + 0x0000)

#define SNC_BOOT_TIMEOUT_MS     100
#define SNC_NHANDLERS           8
#define SNC_NPOLLWAITERS        2
#define SNC_RXQ_LEN             CONFIG_DA1470X_SNC_RXQUEUE

#define g_shared ((struct snc_shared_s *)SNC_SHARED_M33_BASE)

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct snc_handler_s
{
  uint16_t       type;
  snc_handler_t  handler;
  void          *arg;
};

struct snc_dev_s
{
  mutex_t              lock;
  sem_t                rxsem;       /* Readers waiting for a message */
  int                  nwaiters;
  struct work_s        work;        /* Drains the event ring */
  bool                 running;
  bool                 fault_reported;
  uint32_t             dropped_to_snc;
  bool                 rx_blocked;  /* Queue full, events left in RAM8 */
  uint8_t              rxhead;
  uint8_t              rxcount;
  struct snc_msg_s     rxq[SNC_RXQ_LEN];
  struct snc_handler_s handlers[SNC_NHANDLERS];
  FAR struct pollfd   *fds[SNC_NPOLLWAITERS];
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static ssize_t snc_read(FAR struct file *filep, FAR char *buffer,
                        size_t buflen);
static ssize_t snc_write(FAR struct file *filep, FAR const char *buffer,
                         size_t buflen);
static int     snc_ioctl(FAR struct file *filep, int cmd,
                         unsigned long arg);
static int     snc_poll(FAR struct file *filep, FAR struct pollfd *fds,
                        bool setup);
static int     snc_set_sleep_policy(bool deep);
static int     snc_pdtest(FAR struct snc_pdtest_s *t);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* The firmware image, from da1470x_snc_image.S */

extern const uint8_t g_da1470x_snc_image[];
extern const uint8_t g_da1470x_snc_image_end[];

static struct snc_dev_s g_snc =
{
  .lock  = NXMUTEX_INITIALIZER,
  .rxsem = SEM_INITIALIZER(0),
};

static const struct file_operations g_snc_fops =
{
  NULL,           /* open */
  NULL,           /* close */
  snc_read,       /* read */
  snc_write,      /* write */
  NULL,           /* seek */
  snc_ioctl,      /* ioctl */
  NULL,           /* mmap */
  NULL,           /* truncate */
  snc_poll        /* poll */
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static void snc_hold_reset(void)
{
  modifyreg32(DA1470X_CRG_TOP_CLK_SNC_CTRL, 0,
              CRG_TOP_CLK_SNC_CTRL_SNC_RESET_REQ);
}

static void snc_doorbell(void)
{
  putreg32(CRG_XTAL_SET_SYS_IRQ_CTRL_SYS2SNC_IRQ_BIT,
           DA1470X_CRG_XTAL_SET_SYS_IRQ_CTRL);
}

