AlmAck/nuttx/arch/arm/src/da1470x/da1470x_snc.c
/* Readers and pollers learn about a new message.  The lock is held. */

static void snc_notify(FAR struct snc_dev_s *priv)
{
  poll_notify(priv->fds, SNC_NPOLLWAITERS, POLLIN);

  while (priv->nwaiters > 0)
    {
      priv->nwaiters--;
      nxsem_post(&priv->rxsem);
    }
}

static snc_handler_t snc_find_handler(FAR struct snc_dev_s *priv,
                                      uint16_t type, FAR void **arg)
{
  int i;

  for (i = 0; i < SNC_NHANDLERS; i++)
    {
      if (priv->handlers[i].handler != NULL &&
          priv->handlers[i].type == type)
        {
          *arg = priv->handlers[i].arg;
          return priv->handlers[i].handler;
        }
    }

  return NULL;
}

/****************************************************************************
 * Name: snc_worker
 *
 * Description:
 *   Drain the controller's event ring: each message goes to its handler,
 *   or into the queue for /dev/snc0.  Nothing is dropped here: when that
 *   queue is full the rest stays in the ring, where the controller sees
 *   the ring fill and holds back, and draining resumes once a reader has
 *   made room.  The controller is told whenever space was freed.
 *
 ****************************************************************************/

static void snc_worker(FAR void *arg)
{
  FAR struct snc_dev_s *priv = arg;
  struct snc_msg_s msg;
  snc_handler_t handler;
  FAR void *harg;
  bool consumed = false;
  int n;

  if (g_shared->state == SNC_STATE_FAULT && !priv->fault_reported)
    {
      priv->fault_reported = true;
      snerr("SNC fault: PC %08" PRIx32 " LR %08" PRIx32 "\n",
            g_shared->fault_pc, g_shared->fault_lr);
    }

  for (; ; )
    {
      nxmutex_lock(&priv->lock);

      if (snc_ring_peek(&g_shared->to_m33, &msg.type) < 0)
        {
          nxmutex_unlock(&priv->lock);
          break;
        }

      handler = snc_find_handler(priv, msg.type, &harg);
      if (handler == NULL && priv->rxcount >= SNC_RXQ_LEN)
        {
          priv->rx_blocked = true;
          nxmutex_unlock(&priv->lock);
          break;
        }

      n = snc_ring_get(&g_shared->to_m33, &msg.type, msg.payload,
                       sizeof(msg.payload));
      msg.len = n;
      consumed = true;

      if (handler == NULL)
        {
          int slot = (priv->rxhead + priv->rxcount) % SNC_RXQ_LEN;

          memcpy(&priv->rxq[slot], &msg, sizeof(msg));
          priv->rxcount++;
          snc_notify(priv);
        }

      nxmutex_unlock(&priv->lock);

      if (handler != NULL)
        {
          handler(msg.type, msg.payload, msg.len, harg);
        }
    }

  if (consumed && priv->running)
    {
      snc_doorbell();
    }
}

/****************************************************************************
 * Name: snc_interrupt
 ****************************************************************************/

static int snc_interrupt(int irq, FAR void *context, FAR void *arg)
{
  FAR struct snc_dev_s *priv = arg;

  putreg32(CRG_XTAL_RESET_SYS_IRQ_CTRL_SNC2SYS_IRQ_BIT,
           DA1470X_CRG_XTAL_RESET_SYS_IRQ_CTRL);

  if (work_available(&priv->work))
    {
      work_queue(LPWORK, &priv->work, snc_worker, priv, 0);
    }

  return OK;
}

/****************************************************************************
 * Name: snc_read
 ****************************************************************************/

static ssize_t snc_read(FAR struct file *filep, FAR char *buffer,
                        size_t buflen)
{
  FAR struct snc_dev_s *priv = &g_snc;
  FAR struct snc_msg_s *msg;
  size_t n;
  int ret;

  if (buflen < sizeof(struct snc_msg_hdr_s))
    {
      return -EINVAL;
    }

  for (; ; )
    {
      ret = nxmutex_lock(&priv->lock);
      if (ret < 0)
        {
          return ret;
        }

      if (priv->rxcount > 0)
        {
          break;
        }

      if (filep->f_oflags & O_NONBLOCK)
        {
          nxmutex_unlock(&priv->lock);
          return -EAGAIN;
        }

      priv->nwaiters++;
      nxmutex_unlock(&priv->lock);

      ret = nxsem_wait(&priv->rxsem);
      if (ret < 0)
        {
          nxmutex_lock(&priv->lock);
          if (priv->nwaiters > 0)
            {
              priv->nwaiters--;
            }

          nxmutex_unlock(&priv->lock);
          return ret;
        }
    }

  /* One message per read; a short buffer truncates its payload */

  msg = &priv->rxq[priv->rxhead];
  n = sizeof(struct snc_msg_hdr_s) + msg->len;
  if (n > buflen)
    {
      n = buflen;
    }

  memcpy(buffer, msg, n);
  priv->rxhead = (priv->rxhead + 1) % SNC_RXQ_LEN;
  priv->rxcount--;

  /* Room again: go back for what was left in the ring */

  if (priv->rx_blocked)
    {
      priv->rx_blocked = false;
      if (work_available(&priv->work))
        {
          work_queue(LPWORK, &priv->work, snc_worker, priv, 0);
        }
    }

  nxmutex_unlock(&priv->lock);
  return n;
}

/****************************************************************************
 * Name: snc_write
 ****************************************************************************/

static ssize_t snc_write(FAR struct file *filep, FAR const char *buffer,
                         size_t buflen)
{
  FAR const struct snc_msg_s *msg = (FAR const struct snc_msg_s *)buffer;
  int ret;

  if (buflen < sizeof(struct snc_msg_hdr_s) ||
      buflen - sizeof(struct snc_msg_hdr_s) < msg->len)
    {
      return -EINVAL;
    }

  ret = da1470x_snc_send(msg->type, msg->payload, msg->len);
  return ret < 0 ? ret : (ssize_t)(sizeof(struct snc_msg_hdr_s) + msg->len);
}

/****************************************************************************
 * Name: snc_ioctl
 ****************************************************************************/

static int snc_ioctl(FAR struct file *filep, int cmd, unsigned long arg)
{
  switch (cmd)
    {
      case SNCIOC_STATUS:
        {
          FAR struct snc_status_s *status =
            (FAR struct snc_status_s *)((uintptr_t)arg);

          if (status == NULL)
            {
              return -EINVAL;
            }

