AlmAck/nuttx/arch/arm/src/da1470x/da1470x_snc.c
          da1470x_snc_getstatus(status);
          return OK;
        }

      case SNCIOC_STOP:
        da1470x_snc_stop();
        return OK;

      case SNCIOC_START:
        return da1470x_snc_start();

      case SNCIOC_PDTEST:
        return snc_pdtest((FAR struct snc_pdtest_s *)((uintptr_t)arg));

      default:
        return -ENOTTY;
    }
}

/****************************************************************************
 * Name: snc_poll
 ****************************************************************************/

static int snc_poll(FAR struct file *filep, FAR struct pollfd *fds,
                    bool setup)
{
  FAR struct snc_dev_s *priv = &g_snc;
  pollevent_t events = POLLOUT;
  int ret;
  int i;

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  if (setup)
    {
      for (i = 0; i < SNC_NPOLLWAITERS; i++)
        {
          if (priv->fds[i] == NULL)
            {
              priv->fds[i] = fds;
              fds->priv = &priv->fds[i];
              break;
            }
        }

      if (i >= SNC_NPOLLWAITERS)
        {
          ret = -EBUSY;
        }
      else
        {
          if (priv->rxcount > 0)
            {
              events |= POLLIN;
            }

          poll_notify(&fds, 1, events);
        }
    }
  else if (fds->priv != NULL)
    {
      *(FAR struct pollfd **)fds->priv = NULL;
      fds->priv = NULL;
    }

  nxmutex_unlock(&priv->lock);
  return ret;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: da1470x_snc_start
 ****************************************************************************/

int da1470x_snc_start(void)
{
  FAR struct snc_dev_s *priv = &g_snc;
  FAR const struct snc_image_hdr_s *hdr;
  size_t len = g_da1470x_snc_image_end - g_da1470x_snc_image;
  irqstate_t flags;
  int ret;
  int i;

  /* Check the image before anything is touched */

  hdr = (FAR const struct snc_image_hdr_s *)
        (g_da1470x_snc_image + SNC_IMAGE_HDR_OFFSET);

  if (len < SNC_IMAGE_HDR_OFFSET + sizeof(*hdr) ||
      hdr->magic != SNC_IPC_MAGIC ||
      hdr->ipc_version != SNC_IPC_VERSION ||
      hdr->size > len || hdr->size > DA1470X_SNC_CODE_SIZE)
    {
      syslog(LOG_ERR, "SNC image rejected: %zu bytes, header size %" PRIu32
             "\n", len, hdr->size);
      return -ENOEXEC;
    }

  /* The processor lives in PD_SNC, its timer in PD_TIM */

  ret = da1470x_pd_enable(DA1470X_PD_SNC);
  if (ret >= 0)
    {
      ret = da1470x_pd_enable(DA1470X_PD_TIM);
    }

  if (ret < 0)
    {
      snerr("SNC power domains did not come up: %d\n", ret);
      return ret;
    }

  nxmutex_lock(&priv->lock);
  priv->running = false;
  priv->fault_reported = false;

  flags = enter_critical_section();

  /* Load with the processor held still: this is also the path that
   * replaces the firmware of a controller that is already running.
   */

  snc_hold_reset();

  /* Its watchdog is a separate timer that drives its NMI.  Freeze it: a
   * firmware that wants it can unfreeze it itself.
   */

  putreg32(GPREG_SET_FREEZE_FRZ_SNC_WDOG, DA1470X_GPREG_SET_FREEZE);

  /* A fresh shared area, then the image */

  memset(g_shared, 0, sizeof(*g_shared));
  g_shared->magic    = SNC_IPC_MAGIC;
  g_shared->version  = SNC_IPC_VERSION;
  g_shared->lpclk_hz = da1470x_get_lpclk();
  g_shared->state    = SNC_STATE_OFF;

  memcpy((FAR void *)DA1470X_SNC_CODE_BASE, g_da1470x_snc_image,
         hdr->size);

  /* The processor reads through a different port than we wrote, so make
   * sure the writes have landed before it is allowed to fetch.
   */

  __asm__ __volatile__ ("dsb" : : : "memory");

  putreg32(CRG_XTAL_RESET_SYS_IRQ_CTRL_SNC2SYS_IRQ_BIT |
           CRG_XTAL_RESET_SYS_IRQ_CTRL_SYS2SNC_IRQ_BIT,
           DA1470X_CRG_XTAL_RESET_SYS_IRQ_CTRL);

  modifyreg32(DA1470X_CRG_TOP_CLK_SNC_CTRL, 0,
              CRG_TOP_CLK_SNC_CTRL_SNC_CLK_ENABLE);
  modifyreg32(DA1470X_CRG_TOP_CLK_SNC_CTRL,
              CRG_TOP_CLK_SNC_CTRL_SNC_RESET_REQ, 0);

  leave_critical_section(flags);

  /* Wait for it to say it is ready, or that it fell over */

  for (i = 0; i < SNC_BOOT_TIMEOUT_MS; i++)
    {
      if (g_shared->state == SNC_STATE_READY ||
          g_shared->state == SNC_STATE_FAULT)
        {
          break;
        }

      up_mdelay(1);
    }

  if (g_shared->state != SNC_STATE_READY)
    {
      snerr("SNC did not start: state %" PRIu32 ", PC %08" PRIx32 "\n",
            g_shared->state, g_shared->fault_pc);
      snc_hold_reset();
      nxmutex_unlock(&priv->lock);
      return -EIO;
    }

  priv->running = true;
  nxmutex_unlock(&priv->lock);

  sninfo("SNC running, %" PRIu32 " byte image, ready in %d ms\n",
         hdr->size, i);

  /* Anything it said while starting */

  if (work_available(&priv->work))
    {
      work_queue(LPWORK, &priv->work, snc_worker, priv, 0);
    }

  return OK;
}

/****************************************************************************
 * Name: da1470x_snc_stop
 ****************************************************************************/

void da1470x_snc_stop(void)
{
  FAR struct snc_dev_s *priv = &g_snc;
  irqstate_t flags;

  nxmutex_lock(&priv->lock);

  flags = enter_critical_section();
  snc_hold_reset();
  modifyreg32(DA1470X_CRG_TOP_CLK_SNC_CTRL,
              CRG_TOP_CLK_SNC_CTRL_SNC_CLK_ENABLE, 0);
  g_shared->state = SNC_STATE_OFF;
  leave_critical_section(flags);

  priv->running = false;
  nxmutex_unlock(&priv->lock);
}

/****************************************************************************
 * Name: da1470x_snc_getstatus
 ****************************************************************************/

void da1470x_snc_getstatus(FAR struct snc_status_s *status)
{
  FAR struct snc_dev_s *priv = &g_snc;

  status->state          = g_shared->state;
  status->heartbeat      = g_shared->heartbeat;
  status->fault_pc       = g_shared->fault_pc;
  status->fault_lr       = g_shared->fault_lr;
  status->dropped_to_m33 = g_shared->dropped;
  status->dropped_to_snc = priv->dropped_to_snc;
  status->hwstatus       = getreg32(DA1470X_SNC_STATUS);
  status->deep_sleep     = g_shared->deep_sleep;
  status->sleeps         = g_shared->sleeps;
  status->resumes        = g_shared->resumes;
}

/****************************************************************************
 * Name: snc_set_sleep_policy
 ****************************************************************************/

static int snc_set_sleep_policy(bool deep)
{
  uint32_t v = deep;
  int ret;
  int i;

  ret = da1470x_snc_send(SNC_MSG_SLEEP_POLICY, &v, sizeof(v));
  if (ret < 0)
    {
      return ret;
    }

