AlmAck/nuttx/arch/arm/src/da1470x/da1470x_snc.c
  for (i = 0; i < 100 && g_shared->deep_sleep != v; i++)
    {
      nxsched_usleep(1000);
    }

  return g_shared->deep_sleep == v ? OK : -ETIMEDOUT;
}

/****************************************************************************
 * Name: snc_pdtest
 *
 * Description:
 *   Let the controller deep-sleep, switch PD_SNC off for a while and see
 *   whether it kept working: its timer and doorbell wake it through the
 *   power domain controller, which powers the domain for it, and it must
 *   come back from each power loss with its state.  A test only: the
 *   M33's own PD_SNC peripherals -- the console among them -- are gone
 *   meanwhile, and only the console UART is set up again.
 *
 ****************************************************************************/

static int snc_pdtest(FAR struct snc_pdtest_s *t)
{
  static const uintptr_t uarts[3] =
    {
      DA1470X_UART0_BASE, DA1470X_UART1_BASE, DA1470X_UART2_BASE
    };

  uint32_t ier[3];
  uint32_t clk;
  uint32_t hb;
  uint32_t sleeps;
  uint32_t resumes;
  int ret;
  int i;

  if (t == NULL || t->ms == 0 || t->ms > 60000)
    {
      return -EINVAL;
    }

  ret = snc_set_sleep_policy(true);
  if (ret < 0)
    {
      return ret;
    }

  /* Let the console drain before its domain goes */

  for (i = 0; i < 100; i++)
    {
      if (getreg32(DA1470X_UART0_BASE + DA1470X_UART_LSR_OFFSET) &
          UART_LSR_TEMT)
        {
          break;
        }

      nxsched_usleep(1000);
    }

  nxsched_usleep(20000);

  for (i = 0; i < 3; i++)
    {
      ier[i] = getreg32(uarts[i] + DA1470X_UART_IER_DLH_OFFSET);
    }

  clk     = getreg32(DA1470X_CRG_SNC_BASE + DA1470X_CRG_SNC_CLK_SNC_OFFSET);
  hb      = g_shared->heartbeat;
  sleeps  = g_shared->sleeps;
  resumes = g_shared->resumes;

  da1470x_pd_disable(DA1470X_PD_SNC);

  t->went_down = 0;
  for (i = 0; i < 100; i++)
    {
      if (getreg32(DA1470X_CRG_TOP_SYS_STAT) &
          CRG_TOP_SYS_STAT_SNC_IS_DOWN)
        {
          t->went_down = 1;
          break;
        }

      up_udelay(100);
    }

  nxsched_usleep(t->ms * 1000);

  /* Back up, and the console with it */

  da1470x_pd_enable(DA1470X_PD_SNC);
  putreg32(clk, DA1470X_CRG_SNC_BASE + DA1470X_CRG_SNC_CLK_SNC_OFFSET);
  da1470x_lowsetup();
  for (i = 0; i < 3; i++)
    {
      putreg32(ier[i], uarts[i] + DA1470X_UART_IER_DLH_OFFSET);
    }

  t->heartbeat = g_shared->heartbeat - hb;
  t->sleeps    = g_shared->sleeps - sleeps;
  t->resumes   = g_shared->resumes - resumes;

  return snc_set_sleep_policy(false);
}

/****************************************************************************
 * Name: da1470x_snc_send
 ****************************************************************************/

int da1470x_snc_send(uint16_t type, FAR const void *payload, uint16_t len)
{
  FAR struct snc_dev_s *priv = &g_snc;
  int ret;

  if (len > SNC_MSG_MAX_PAYLOAD || (len > 0 && payload == NULL))
    {
      return -EINVAL;
    }

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  if (!priv->running)
    {
      ret = -ENODEV;
    }
  else if (g_shared->state != SNC_STATE_READY)
    {
      /* It faulted: nothing will read the ring until it is restarted */

      ret = -EIO;
    }
  else if (snc_ring_put(&g_shared->to_snc, type, payload, len) < 0)
    {
      priv->dropped_to_snc++;
      ret = -EAGAIN;
    }
  else
    {
      snc_doorbell();
    }

  nxmutex_unlock(&priv->lock);
  return ret;
}

/****************************************************************************
 * Name: da1470x_snc_register_handler
 ****************************************************************************/

int da1470x_snc_register_handler(uint16_t type, snc_handler_t handler,
                                 FAR void *arg)
{
  FAR struct snc_dev_s *priv = &g_snc;
  int free_slot = -1;
  int ret;
  int i;

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  for (i = 0; i < SNC_NHANDLERS; i++)
    {
      if (priv->handlers[i].handler != NULL &&
          priv->handlers[i].type == type)
        {
          break;
        }

      if (priv->handlers[i].handler == NULL && free_slot < 0)
        {
          free_slot = i;
        }
    }

  if (i >= SNC_NHANDLERS)
    {
      i = free_slot;
    }

  if (i < 0)
    {
      ret = handler == NULL ? OK : -ENOMEM;
    }
  else
    {
      priv->handlers[i].type    = type;
      priv->handlers[i].handler = handler;
      priv->handlers[i].arg     = arg;
    }

  nxmutex_unlock(&priv->lock);
  return ret;
}

/****************************************************************************
 * Name: da1470x_snc_initialize
 ****************************************************************************/

int da1470x_snc_initialize(FAR const char *devpath)
{
  int ret;

  /* RAM8 survives a reset: clear what a previous firmware left there, so
   * that a controller that never starts is not reported as running.
   */

  memset(g_shared, 0, sizeof(*g_shared));

  irq_attach(DA1470X_IRQ_SNC2SYS, snc_interrupt, &g_snc);
  up_enable_irq(DA1470X_IRQ_SNC2SYS);

#ifdef CONFIG_DA1470X_PDC
  /* Let the controller's doorbell wake the M33 from its sleep states */

  da1470x_pdc_add(DA1470X_PDC_TRIG_PERIPHERAL, DA1470X_PDC_PERIPH_SNC2SYS,
                  DA1470X_PDC_MASTER_CM33, DA1470X_PDC_FLAG_EN_XTAL);

  /* And its timer and the M33's doorbell wake the controller, powering
   * PD_SNC for it if the domain is down.
   */

  da1470x_pdc_add(DA1470X_PDC_TRIG_PERIPHERAL, DA1470X_PDC_PERIPH_TIMER6,
                  DA1470X_PDC_MASTER_SNC,
                  DA1470X_PDC_FLAG_EN_XTAL | DA1470X_PDC_FLAG_EN_SNC);
  da1470x_pdc_add(DA1470X_PDC_TRIG_PERIPHERAL, DA1470X_PDC_PERIPH_SYS2SNC,
                  DA1470X_PDC_MASTER_SNC,
                  DA1470X_PDC_FLAG_EN_XTAL | DA1470X_PDC_FLAG_EN_SNC);
#endif

  ret = da1470x_snc_start();

  if (register_driver(devpath, &g_snc_fops, 0666, &g_snc) < 0)
    {
      snerr("Failed to register %s\n", devpath);
    }

  return ret;
}

#endif /* CONFIG_DA1470X_SNC */
